Autodesk.Revit.DB.BuiltInFailures.DatumPlaneFailures.ScopeBoxWrongPosition
The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box.

Autodesk.Revit.DB.BuiltInFailures.DatumPlaneFailures
Failures about DatumPlane.